package e24;
import java.util.Arrays;
/*你和朋友的音乐契合度高达99%！

我们提供两个数组，分别包含你们最近播放的所有音乐。让我们看看你们是否在听同一个播放列表！

但要注意——歌曲是随机播放的 ，并且按歌曲代码列出！

int[] playlistA = {
        3094234, 12323, 90990, 373737, 128732, 4388934, 2343947, 6548234, 234823, 4568,
        2345234, 234234, 678768, 6456, 787, 46456, 678567, 354345, 23423, 645745, 23423,
        2435423, 786768, 678786
};

int[] playlistB = {
        234823, 678786, 354345, 3094234, 6456, 678567, 23423, 786768,
        46456, 128732, 6548234, 234234, 4568, 4388934, 23423, 12323,
        2343947, 2435423, 645745, 678768, 2345234, 90990, 373737, 787
};

为了确定这两个播放列表是否相同，我们可以对两个数组使用 .sort() 方法，然后使用 .equals() 方法查看两个排序后的数组是否相同。

如果播放列表相同，则打印“这是同一个播放列表！”。否则，打印“未找到匹配项。”（这些播放列表应该匹配！）*/
public class demo {
    public static void main(String[] args) {
        int[] playlistA = {
                3094234, 12323, 90990, 373737, 128732, 4388934, 2343947, 6548234, 234823, 4568,
                2345234, 234234, 678768, 6456, 787, 46456, 678567, 354345, 23423, 645745, 23423,
                2435423, 786768, 678786
        };

        int[] playlistB = {
                234823, 678786, 354345, 3094234, 6456, 678567, 23423, 786768,
                46456, 128732, 6548234, 234234, 4568, 4388934, 23423, 12323,
                2343947, 2435423, 645745, 678768, 2345234, 90990, 373737, 787
        };
        Arrays.sort(playlistA);
        Arrays.sort(playlistB);
        System.out.println(Arrays.toString(playlistA));
        System.out.println(Arrays.toString(playlistB));
        System.out.println(Arrays.equals(playlistA, playlistB));

    }
}
