package e14;
/*你现在在主题公园！要乘坐某些游乐设施，你的身高和体重必须达到一定标准。否则，你就得等到明年了。

编写一个程序，检查体重超过 40 公斤且身高超过 120 厘米的人是否可以乘坐过山车。

如果两个条件都满足，则打印“恭喜！你可以骑车了！”🎢
否则，就会收到“抱歉，您今天不能骑车。”😞*/
public class demo {
    public static void main(String[] args) {
        int wight = 39;
        int height = 111;
        if(wight >=40 &&  height >=120)
        {
            System.out.println("恭喜！你可以骑车了！");
        }
        else if(wight >= 40 && height < 120)
        {
            System.out.println("no");
        }
        else if(height >= 120 && wight < 40)
        {
            System.out.println("no");
        }
        else
        {
            System.out.println("抱歉，您今天不能骑车。");
        }
    }
}
