package e23;
/*将以下数组复制并粘贴到代码编辑器中：

int[] keys = {2348, 2345823, 654, 30458, 5049, 589458, 3248238,  2374, 4234, 87756, 45654, 4654, 4566, 465465, 908, 798, 678, 67856785, 100, 234852, 23485, 456654, 543, 324534, 45678, 354, 345423, 23423, 5685, 98567, 23465, 6987, 456, 456, 798};

你必须找到编号为 100 的 🔑金钥匙。

遍历 keys 数组，如果在数组中找到金钥匙，则打印“你找到了金钥匙！”。否则，结束程序。

祝你好运！🔒*/
public class demo {
    public static void main(String[] args) {
        int[] keys = {2348, 2345823, 654, 30458, 5049, 589458, 3248238,  2374, 4234, 87756, 45654, 4654, 4566, 465465, 908, 798, 678, 67856785, 100, 234852, 23485, 456654, 543, 324534, 45678, 354, 345423, 23423, 5685, 98567, 23465, 6987, 456, 456, 798};
        for (int i = 0; i < keys.length; i++)
        {
            if(keys[i]==100)
            {
                System.out.println("你找到了金钥匙！");
            }
            else
                {
                System.out.println(keys[i]);
                }
        }
    }
}
